app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments".parent_id = 6)
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("edited", "created_at", "title", "updated_at", "flag_id", "user_id", "parent_id", "content", "topic_id", "fallacy_id") VALUES(NULL, '2010-01-10 16:08:00', 'rgtertydf ertert wertwertwer', '2010-01-10 16:08:00', NULL, 1, NULL, 'ghgfh ertyerty ertwertw wertwert wertwert', 1, NULL)
---
  def create
    unless enabled_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end

    @comment = Comment.new(params[:comment])
    # make sure to set the comment's user_id to the current user...
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save