app/controllers/fallacies_controller.rb

  def show
    @fallacy = Fallacy.find(params[:id])
---
SELECT * FROM "fallacies" WHERE ("fallacies"."id" = 1)

  def edit
    @fallacy = Fallacy.find(params[:id])
---
SELECT * FROM "fallacies" WHERE ("fallacies"."id" = 1)

  def create
    @fallacy = Fallacy.new(params[:fallacy])

    respond_to do |format|
      if @fallacy.save
---
INSERT INTO "fallacies" ("shortname", "created_at", "title", "updated_at", "content") VALUES('circular', '2010-01-10 14:31:03', 'The circular argument', '2010-01-10 14:31:03', 'When the premises already contain the conclusion, which contain the premises.')

  def update
    @fallacy = Fallacy.find(params[:id])

    respond_to do |format|
      if @fallacy.update_attributes(params[:fallacy])
---
SELECT * FROM "fallacies" WHERE ("fallacies"."id" = 1)
UPDATE "fallacies" SET "updated_at" = '2010-01-10 12:14:09', "content" = 'h3. Context

  def destroy
    @fallacy = Fallacy.find(params[:id])
    @fallacy.destroy
---
SELECT * FROM "fallacies" WHERE ("fallacies"."id" = 2)
DELETE FROM "fallacies" WHERE "id" = 2