app/controllers/flags_controller.rb

  def show
    @flag = Flag.find(params[:id])
---
SELECT * FROM "flags" WHERE ("flags"."id" = 1)

  def edit
    @flag = Flag.find(params[:id])
---
SELECT * FROM "flags" WHERE ("flags"."id" = 4)

  def create
    @flag = Flag.new(params[:flag])

    respond_to do |format|
      if @flag.save
---
INSERT INTO "flags" ("created_at", "updated_at", "user_id", "content", "topic_id", "fallacy_id") VALUES('2010-01-10 17:04:44', '2010-01-10 17:04:44', 1, 'Oh there clearly is an ad hominem fallacy in there ! Sure is !', 2, 1)

  def update
    @flag = Flag.find(params[:id])
---
SELECT * FROM "flags" WHERE ("flags"."id" = 4)

  def destroy
    unless admin_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end

    @flag = Flag.find(params[:id])
    @flag.destroy
---
SELECT * FROM "flags" WHERE ("flags"."id" = 4)
DELETE FROM "flags" WHERE "id" = 4