app/controllers/tags_controller.rb

  def show
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 4)

  def destroy
    @tag = Tag.find(params[:id])
    unless admin_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end

    @tag.destroy
---
SELECT * FROM "tags" WHERE ("tags"."id" = 2)
DELETE FROM "tags" WHERE "id" = 2