app/controllers/topics_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def show
    @topic = Topic.find(params[:id])

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def edit
    unless enabled_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end
    @topic = Topic.find(params[:id])

INSERT INTO "topics" ("created_at", "title", "updated_at", "url", "origin", "content") VALUES('2010-01-18 20:23:38', 'Introduction to the Logical Fallacies Club', '2010-01-18 20:23:38', 'http://www.independent.co.uk/opinion/commentators/yasmin-alibhai-brown/yasmin-alibhaibrown-licentiousness-breeds-extremism-1863919.html', 'Introduction and Initial Offering', 'h1. Fellow Stoics,
---
  def create
    unless enabled_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
UPDATE "topics" SET "updated_at" = '2010-01-10 14:08:50', "origin" = 'This argument was *spotted* on a _forum_ on the "internet":http://internet.com.' WHERE "id" = 1
---
  def update
    unless enabled_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end
    @topic = Topic.find(params[:id])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])

SELECT * FROM "topics" WHERE ("topics"."id" = 2)
DELETE FROM "topics" WHERE "id" = 2
---
  def destroy
    unless admin_user
      flash[:error] = 'Forbidden action.'
      redirect_to root_url
    end

    @topic = Topic.find(params[:id])
    @topic.destroy