app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def index
    if not admin_user
        flash[:error] = "You can't list the user profiles"
        redirect_to root_url
        return
    end
    @users = User.find(:all)

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show
    unless can_edit_user(User.find(params[:id]))

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def edit
    if params[:id]=='current'
      @user = current_user
    else
      unless can_edit_user(User.find params[:id])

INSERT INTO "users" ("name", "created_at", "crypted_password", "updated_at", "admin", "enabled", "password_salt", "persistence_token", "email") VALUES('ghiom', '2010-01-10 11:31:23', '2c8661c9844b76f88fc3d0c80ddb1e5c00dff77b9395e1592fc84d6532067f32372787c8229c032b093f7ba3df498e069942618786edcfbc446ded6e4893a2c6', '2010-01-10 11:31:23', 'f', 't', 'x7n2sqEl4hvX5VGHtkoZ', '8c4629dd5593d5ad44c821984a57eead02dc489b90db7bd1c105ec4732004a9abe1b5097bb2272c399020f4892c0c29ae608a69ea9c791f3963ca8eb5af5c701', 'subtenante@gmail.com')
---
  def create
    @user = User.new(params[:user])
    @user.enabled = true
    @user.admin = false
    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-01-12 20:37:17', "name" = 'ghi-om' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    unless admin_user or @user.enabled
        params[:user][:enabled] = false
    end
    unless admin_user or @user.admin
        params[:user][:admin] = false
    end

    respond_to do |format|
      if @user.update_attributes(params[:user])